justimepassnow/custom_servo/mm32_test/src/main.c
#include "mm32_device.h"
#include <stdint.h>
#include <stdio.h>

#define BUF_SIZE 32
#define ANGLE_MIN 45
#define ANGLE_MAX 280
#define PID_INTERVAL_MS 1
#define INTEGRAL_LIMIT_Q8 25600000 // ~100 degree-seconds max windup limit in Q8
#define DEADBAND_Q8 128      // 0.5 degrees deadband in Q8

// Logging Configuration (Set to 0 for silent multi-servo production daisy-chaining)
#define DEBUG_LOG 1

// Protocol packet parsing states
typedef enum {
    RX_STATE_HEADER1 = 0,
    RX_STATE_HEADER2,
    RX_STATE_ID,
    RX_STATE_LENGTH,
    RX_STATE_INSTRUCTION,
    RX_STATE_PARAMETERS,
    RX_STATE_CHECKSUM
} RxState;

// Configuration structure matching implementation specification (26 bytes)
typedef struct __attribute__((packed)) {
    uint8_t  servo_id;        // 0-253, default: 0
    uint8_t  direction_invert;// 0 = normal, 1 = inverted motor direction
    uint16_t min_angle;       // minimum angle, e.g., 45
    uint16_t max_angle;       // maximum angle, e.g., 280
    uint16_t max_velocity;    // degrees per second, default e.g. 180
    uint16_t current_limit;   // raw current ADC threshold (or mA threshold), default e.g. 1000
    int32_t  kp_q16;          // PID proportional gain
    int32_t  ki_q16;          // PID integral gain
    int32_t  kd_q16;          // PID derivative gain
    uint16_t hard_min_angle;  // physical degree angle at ADC = 0 (default: 0)
    uint16_t hard_max_angle;  // physical degree angle at ADC = 4095 (default: 300)
    uint32_t magic;           // 0xDEADBEEF Magic Word
} ServoConfig;

// Global variables
ServoConfig config;
uint32_t SystemCoreClock = 8000000U;

// PID active fixed-point gains (pre-calculated for 1ms time-step)
volatile int32_t Kp_q16;
volatile int32_t Ki_q16;
volatile int32_t Kd_q16;

// PID state variables (pure integer, Q8 fixed-point format)
int32_t pid_error = 0;
int32_t prev_error = 0;
int32_t pid_integral = 0;
int32_t pid_derivative = 0;

// Motion target, trajectory profiling (Ghost Target) and feedback
volatile int32_t target_angle = 150;      // default target (degrees)
volatile int32_t ghost_angle_q8 = 150*256; // Ghost Target in Q8
volatile int32_t current_angle = 0;       // Current physical angle
volatile int32_t current_angle_q8 = 0;    // Current physical angle in Q8
volatile uint16_t active_velocity = 180;  // Active velocity in deg/s
volatile uint8_t status_reporting_enabled = 0;

// Safety and Fault Management flags
volatile uint8_t overcurrent_fault = 0;
volatile uint8_t stall_fault = 0;
volatile uint32_t overcurrent_ms = 0;
volatile uint8_t motor_armed = 0; // Arm on first valid CONTROL packet
volatile int32_t zero_current_offset_adc = 0; // Startup auto-zero calibration offset

typedef enum {
    TUNE_STATE_IDLE = 0,
    TUNE_STATE_START,
    TUNE_STATE_RUNNING,
    TUNE_STATE_CALCULATING,
    TUNE_STATE_FAILED
} TuneState;

// Global tuning variables
volatile TuneState tune_state = TUNE_STATE_IDLE;
int32_t tune_midpoint_q8 = 0;
int32_t tune_relay_amplitude = 0; // d (PWM duty cycle counts)
int32_t tune_hysteresis_q8 = 128;   // H (0.5 degrees)
uint32_t tune_target_cycles = 5;
uint32_t tune_cycle_count = 0;
uint32_t tune_last_crossing_time = 0;
uint32_t tune_cycle_start_time = 0;

// Oscillation data collection
int32_t tune_peak_high = -999999;
int32_t tune_peak_low = 999999;
int32_t tune_relay_output = 0; // Active drive direction (+d or -d)
int32_t tune_amplitude_sum = 0;
int32_t tune_period_sum = 0;
uint32_t tune_timeout_ms = 0;

void print_status(void);
int32_t read_current_ma(void);
void send_config_reply(void);

// Flash Erase/Write Helper Functions
void flash_erase_page(uint32_t address) {
    if (READ_BIT(FLASH->CR, FLASH_CR_LOCK)) {
        WRITE_REG(FLASH->KEYR, 0x45670123);
        WRITE_REG(FLASH->KEYR, 0xCDEF89AB);
    }
    WRITE_REG(FLASH->SR, FLASH_SR_EOP | FLASH_SR_WRPRTERR | FLASH_SR_PGERR);
    SET_BIT(FLASH->CR, FLASH_CR_PER);
    WRITE_REG(FLASH->AR, address);
    SET_BIT(FLASH->CR, FLASH_CR_STRT);
    while (READ_BIT(FLASH->SR, FLASH_SR_BSY));
    CLEAR_BIT(FLASH->CR, FLASH_CR_PER);
    WRITE_REG(FLASH->SR, FLASH_SR_EOP | FLASH_SR_WRPRTERR | FLASH_SR_PGERR);
}

void flash_write_halfword(uint32_t address, uint16_t data) {
    SET_BIT(FLASH->CR, FLASH_CR_PG);
    *(volatile uint16_t *)address = data;
    while (READ_BIT(FLASH->SR, FLASH_SR_BSY));
    CLEAR_BIT(FLASH->CR, FLASH_CR_PG);
    WRITE_REG(FLASH->SR, FLASH_SR_EOP | FLASH_SR_WRPRTERR | FLASH_SR_PGERR);
}

void flash_write_config(ServoConfig *cfg) {
    // 1. Temporarily force motor compare registers to 0 for safety
    TIM_SetCompare3(TIM1, 0);
    TIM_SetCompare2(TIM1, 0);

    // 2. Erase flash page 15 (last 1KB of 16KB FLASH, starting at 0x08003C00)
    flash_erase_page(0x08003C00);

    // 3. Write config struct (rounded up to write final odd byte safely if struct size changes, pure compile-time integer math)
    uint16_t *src = (uint16_t *)cfg;
    for (size_t i = 0; i < (sizeof(ServoConfig) + 1) / 2; i++) {
        flash_write_halfword(0x08003C00 + i * 2, src[i]);
    }

    // 4. Re-lock Flash Memory
    SET_BIT(FLASH->CR, FLASH_CR_LOCK);
}

void flash_load_config(ServoConfig *cfg) {
    ServoConfig *flash_cfg = (ServoConfig *)0x08003C00;
    if (flash_cfg->magic == 0xDEADBEEF) {
        *cfg = *flash_cfg;
    } else {
        // Load default parameters
        cfg->servo_id = 0; // Default ID is 0 as explicitly requested!
        cfg->direction_invert = 0; // Default direction: normal (0)
        cfg->min_angle = 45;
        cfg->max_angle = 280;
        cfg->max_velocity = 180; // default 180 degrees/sec
        cfg->current_limit = 1000; // raw threshold/mA limit
        cfg->kp_q16 = 6553600;     // Kp = 100.0 * 65536
        cfg->ki_q16 = 3276;        // Ki = 0.05 * 65536 (unscaled)
        cfg->kd_q16 = 524288;      // Kd = 8.0 * 65536 (unscaled)
        cfg->hard_min_angle = 0;   // Default 0 deg at ADC = 0
        cfg->hard_max_angle = 300; // Default 300 deg at ADC = 4095
        cfg->magic = 0xDEADBEEF;

        // Persist default config to flash
        flash_write_config(cfg);
    }

    // Keep unscaled Q16 gains for high-precision dynamic scaling in PID loop
    Kp_q16 = cfg->kp_q16;
    Ki_q16 = cfg->ki_q16;
    Kd_q16 = cfg->kd_q16;
}

