justimepassnow/custom_servo/mm32_test/src/main.c
// System Init
void SystemInit(void) {
    RCC->CR |= RCC_CR_HSION;
    while (!(RCC->CR & RCC_CR_HSIRDY));
    
    FLASH->ACR &= ~FLASH_ACR_LATENCY_Msk;
    FLASH->ACR |= FLASH_ACR_LATENCY_1;
    FLASH->ACR |= FLASH_ACR_PRFTBE;
    
    RCC->CFGR &= ~RCC_CFGR_HPRE_Msk;
    RCC->CFGR |= (0x00U << RCC_CFGR_HPRE_Pos);
    
    RCC->CFGR &= ~RCC_CFGR_PPRE1_Msk;
    RCC->CFGR |= (0x00U << RCC_CFGR_PPRE1_Pos);
    
    RCC->CFGR &= ~RCC_CFGR_SW_Msk;
    RCC->CFGR |= (0x02U << RCC_CFGR_SW_Pos);
    
    while ((RCC->CFGR & RCC_CFGR_SWS_Msk) != (0x02U << RCC_CFGR_SWS_Pos)) {
        __ASM("nop");
    }
    
    SystemCoreClock = 48000000U;
}

void delay_ms(uint32_t ms) {
    for (volatile uint32_t i = 0; i < ms * 6000; i++) {
        __ASM("nop");
    }
}

// UART Half-Duplex Single-Wire Helper Functions
void uart_enable_tx(void) {
    USART_RxCmd(USART1, DISABLE);
    USART_TxCmd(USART1, ENABLE);
}

void uart_enable_rx(void) {
    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET);
    USART_TxCmd(USART1, DISABLE);
    USART_RxCmd(USART1, ENABLE);
}

void uart_init(void) {
    GPIO_InitTypeDef GPIO_InitStruct;
    USART_InitTypeDef USART_InitStruct;

    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_USART1, ENABLE);

    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_12;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AF_OD; // Open-Drain for single-wire Shared Bus
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_PinAFConfig(GPIOA, GPIO_PinSource12, GPIO_AF_1);

    USART_StructInit(&USART_InitStruct);
    USART_InitStruct.USART_BaudRate   = 115200;
    USART_InitStruct.USART_WordLength = USART_WordLength_8b;
    USART_InitStruct.USART_StopBits   = USART_StopBits_1;
    USART_InitStruct.USART_Parity     = USART_Parity_No;
    USART_InitStruct.USART_Mode       = USART_Mode_Rx; // Start listening initially
    USART_Init(USART1, &USART_InitStruct);

    USART_HalfDuplexCmd(USART1, ENABLE);
    USART_Cmd(USART1, ENABLE);
}

void uart_putchar_raw(char c) {
    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
    USART_SendData(USART1, (uint16_t)c);
}

void uart_putchar(char c) {
    uart_enable_tx();
    uart_putchar_raw(c);
    uart_enable_rx();
}

void uart_print(const char *str) {
    uart_enable_tx();
    while (*str) {
        if (*str == '\n') {
            uart_putchar_raw('\r');
        }
        uart_putchar_raw(*str++);
    }
    uart_enable_rx();
}

void uart_print_int(uint32_t val) {
    char buf[12];
    int i = 10;
    buf[11] = '\0';
    if (val == 0) {
        uart_print("0");
        return;
    }
    while (val > 0 && i >= 0) {
        buf[i--] = (val % 10) + '0';
        val /= 10;
    }
    uart_print(&buf[i + 1]);
}

void uart_print_float(float val) {
    if (val < 0.0f) {
        uart_print("-");
        val = -val;
    }
    uint32_t integer_part = (uint32_t)val;
    uint32_t fractional_part = (uint32_t)((val - (float)integer_part) * 100.0f + 0.5f);
    uart_print_int(integer_part);
    uart_print(".");
    if (fractional_part < 10) {
        uart_print("0");
    }
    uart_print_int(fractional_part);
}

// 1ms SysTick interrupts
volatile uint32_t ms_ticks = 0;
void SysTick_Handler(void) {
    ms_ticks++;
}

uint32_t millis(void) {
    return ms_ticks;
}

// ADC Helper Functions
void adc_init(void) {
    ADC_InitTypeDef  ADC_InitStruct;
    GPIO_InitTypeDef GPIO_InitStruct;

    // 1. Enable ADC1 peripheral clock
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_ADC1, ENABLE);

    // 2. Initialize ADC1
    ADC_StructInit(&ADC_InitStruct);
    ADC_InitStruct.ADC_Resolution       = ADC_Resolution_12b;
    ADC_InitStruct.ADC_Prescaler        = ADC_Prescaler_3; // 16MHz ADC clock @ 48MHz PCLK
    ADC_InitStruct.ADC_Mode             = ADC_Mode_Imm;
    ADC_InitStruct.ADC_DataAlign        = ADC_DataAlign_Right;
    ADC_Init(ADC1, &ADC_InitStruct);

    // 3. Configure sampling time for fast and safe settling (14.5 + 12.5 = 27 cycles @ 8MHz = 3.3us)
    ADC_SampleTimeConfig(ADC1, ADC_SampleTime_14_5);

    // 4. Configure PA7 and PA2 as Analog Inputs (AIN)
    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_GPIOA, ENABLE);
    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_7 | GPIO_Pin_2; // PA7 = Potentiometer, PA2 = Current Sensor
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AIN;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 5. Enable ADC1
    ADC_Cmd(ADC1, ENABLE);
}

uint16_t adc_read(uint8_t channel) {
    static uint8_t last_channel = 0xFF;
    
    ADC_AnyChannelNumCfg(ADC1, 0);
    ADC_AnyChannelSelect(ADC1, ADC_AnyChannel_0, channel);
    ADC_AnyChannelCmd(ADC1, ENABLE);

    // 1. Perform dummy conversion ONLY if we switched channels to let the S&H capacitor settle
    if (channel != last_channel) {
        last_channel = channel;
        
        ADC_SoftwareStartConvCmd(ADC1, ENABLE);
        while (RESET == ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC)) {
            __ASM("nop");
        }
        ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
        (void)ADC_GetConversionValue(ADC1);
    }

    // 2. Perform actual high-precision conversion
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    while (RESET == ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC)) {
        __ASM("nop");
    }

    ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
    uint16_t value = ADC_GetConversionValue(ADC1);

    ADC_AnyChannelCmd(ADC1, DISABLE);

    return value;
}

int32_t read_current_ma(void) {
    static int32_t filtered_current_q8 = -1;
    
    // Perform fast non-blocking analog conversion (filtered by EMA)
    uint16_t raw_adc = adc_read(ADC_Channel_5); // PA2 maps to ADC1_VIN[5]
    
    // Apply baseline offset calibration
    int32_t corrected_raw = (int32_t)raw_adc - zero_current_offset_adc;
    if (corrected_raw < 0) {
        corrected_raw = 0; // Prevent negative current draw readings
    }
    
    // Scale standard integer calculation directly to Q8 format
    // Math: current_ma_q8 = (corrected_raw * 3300 * 256) / 4095 = (corrected_raw * 844800) / 4095
    // Cast to 64-bit integer before multiplying to prevent 32-bit arithmetic overflow!
    int32_t current_ma_q8 = (int32_t)(((int64_t)corrected_raw * 844800) / 4095);
    
    if (filtered_current_q8 < 0) {
        filtered_current_q8 = current_ma_q8;
    } else {
        // Apply EMA filter: alpha = 0.15 -> Q8 weight is 38/256
        filtered_current_q8 = (38 * current_ma_q8 + 218 * filtered_current_q8) >> 8;
    }
    
