justimepassnow/custom_servo/mm32_test/src/main.c
    return filtered_current_q8 >> 8; // convert back to standard integer milliamps
}

// Transmit immediate status packet reply (echoing instruction)
void send_status_reply(uint8_t echoed_instruction) {
    // 1ms Turnaround delay to let master (RP2040) switch to RX mode and clear its echo buffer
    delay_ms(1);
    
    uint8_t packet[11];
    packet[0] = 0xFF;
    packet[1] = 0xFF;
    packet[2] = config.servo_id;
    packet[3] = 0x07; // Length: Instruction (1) + 5 Params + Checksum (1)
    packet[4] = echoed_instruction;
    
    // Param 0,1: Current Angle (LSB/MSB)
    packet[5] = (uint8_t)(current_angle & 0xFF);
    packet[6] = (uint8_t)((current_angle >> 8) & 0xFF);
    
    // Param 2,3: Current Draw (LSB/MSB)
    int32_t current_ma = read_current_ma();
    packet[7] = (uint8_t)(current_ma & 0xFF);
    packet[8] = (uint8_t)((current_ma >> 8) & 0xFF);
    
    // Param 4: Status Flags (Bit 0: Moving, Bit 1: Over_Current, Bit 2: Stall)
    uint8_t flags = 0;
    if (status_reporting_enabled) {
        flags |= (1 << 0);
    }
    if (overcurrent_fault) {
        flags |= (1 << 1);
    }
    if (stall_fault) {
        flags |= (1 << 2);
    }
    packet[9] = flags;
    
    // Checksum: lower 8 bits of bitwise NOT of sum of ID to last parameter
    uint8_t sum = packet[2] + packet[3] + packet[4] + packet[5] + packet[6] + packet[7] + packet[8] + packet[9];
    packet[10] = ~sum;
    
    // Transmit over shared single-wire bus
    uart_enable_tx();
    for (int i = 0; i < 11; i++) {
        uart_putchar_raw((char)packet[i]);
    }
    uart_enable_rx();
}

void send_config_reply(void) {
    // 1ms Turnaround delay to let master (RP2040) switch to RX mode and clear its echo buffer
    delay_ms(1);
    
    uint8_t packet[36];
    packet[0] = 0xFF;
    packet[1] = 0xFF;
    packet[2] = config.servo_id;
    packet[3] = 32; // Length: Instruction (1) + 30 Params + Checksum (1)
    packet[4] = 0x05; // Echoed Instruction
    
    // Copy the entire 30-byte config struct as parameters
    uint8_t *config_bytes = (uint8_t *)&config;
    for (int i = 0; i < 30; i++) {
        packet[5 + i] = config_bytes[i];
    }
    
    // Checksum: lower 8 bits of bitwise NOT of sum of ID to last parameter
    uint8_t sum = packet[2] + packet[3] + packet[4];
    for (int i = 0; i < 30; i++) {
        sum += packet[5 + i];
    }
    packet[35] = ~sum;
    
    // Transmit over shared single-wire bus
    uart_enable_tx();
    for (int i = 0; i < 36; i++) {
        uart_putchar_raw((char)packet[i]);
    }
    uart_enable_rx();
}

// Non-blocking binary packet parser
void process_packet_input(void) {
    static RxState rx_state = RX_STATE_HEADER1;
    static uint8_t rx_id = 0;
    static uint8_t rx_length = 0;
    static uint8_t rx_instruction = 0;
    static uint8_t rx_params[32];
    static uint8_t rx_param_count = 0;
    static uint8_t target_param_count = 0;

    if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) != RESET) {
        uint8_t c = (uint8_t)USART_ReceiveData(USART1);

        switch (rx_state) {
            case RX_STATE_HEADER1:
                if (c == 0xFF) {
                    rx_state = RX_STATE_HEADER2;
                }
                break;
            case RX_STATE_HEADER2:
                if (c == 0xFF) {
                    rx_state = RX_STATE_ID;
                } else {
                    rx_state = RX_STATE_HEADER1;
                }
                break;
            case RX_STATE_ID:
                if (c == config.servo_id || c == 0xFE) { // Explicit ID or Broadcast ID
                    rx_id = c;
                    rx_state = RX_STATE_LENGTH;
                } else {
                    rx_state = RX_STATE_HEADER1;
                }
                break;
            case RX_STATE_LENGTH:
                if (c >= 2 && c <= 32) {
                    rx_length = c;
                    rx_state = RX_STATE_INSTRUCTION;
                } else {
                    rx_state = RX_STATE_HEADER1;
                }
                break;
            case RX_STATE_INSTRUCTION:
                rx_instruction = c;
                rx_param_count = 0;
                target_param_count = rx_length - 2;
                if (target_param_count > 0) {
                    rx_state = RX_STATE_PARAMETERS;
                } else {
                    rx_state = RX_STATE_CHECKSUM;
                }
                break;
            case RX_STATE_PARAMETERS:
                rx_params[rx_param_count++] = c;
                if (rx_param_count >= target_param_count) {
                    rx_state = RX_STATE_CHECKSUM;
                }
                break;
            case RX_STATE_CHECKSUM:
                {
                    uint8_t rx_checksum = c;
                    uint8_t sum = rx_id + rx_length + rx_instruction;
                    for (uint8_t i = 0; i < target_param_count; i++) {
                        sum += rx_params[i];
                    }
                    uint8_t calculated_checksum = ~sum;

                    if (calculated_checksum == rx_checksum) {
                        // 1. CONTROL Command
                        if (rx_instruction == 0x01) {
                            if (!overcurrent_fault && !stall_fault) {
                                uint16_t cmd_angle = rx_params[0] | (rx_params[1] << 8);
                                uint16_t cmd_velocity = rx_params[2] | (rx_params[3] << 8);
                                
                                if (cmd_angle < config.min_angle) cmd_angle = config.min_angle;
                                if (cmd_angle > config.max_angle) cmd_angle = config.max_angle;
                                
                                target_angle = cmd_angle;
                                active_velocity = (cmd_velocity == 0) ? config.max_velocity : cmd_velocity;
                                status_reporting_enabled = 1;
                                motor_armed = 1; // Arm motor upon first valid CONTROL command!
                            }
                            if (rx_id != 0xFE) {
                                send_status_reply(0x01);
                            }
                        } 
                        // 2. CONFIG Command
                        else if (rx_instruction == 0x02) {
                            uint8_t update_mask = rx_params[0];
                            ServoConfig new_cfg = config;
                            
