justimepassnow/custom_servo/mm32_test/src/main.c
                            if (update_mask & (1 << 0)) {
                                new_cfg.servo_id = rx_params[1] & 0x7F; // Extract 7-bit ID
                                new_cfg.direction_invert = (rx_params[1] >> 7) & 0x01; // Extract MSB as direction invert flag
                            }
                            if (update_mask & (1 << 1)) {
                                new_cfg.min_angle = rx_params[2] | (rx_params[3] << 8);
                                new_cfg.max_angle = rx_params[4] | (rx_params[5] << 8);
                            }
                            if (update_mask & (1 << 2)) {
                                new_cfg.max_velocity = rx_params[6] | (rx_params[7] << 8);
                            }
                            if (update_mask & (1 << 3)) {
                                new_cfg.current_limit = rx_params[8] | (rx_params[9] << 8);
                            }
                            if (update_mask & (1 << 4)) {
                                new_cfg.kp_q16 = rx_params[10] | (rx_params[11] << 8) | (rx_params[12] << 16) | (rx_params[13] << 24);
                                new_cfg.ki_q16 = rx_params[14] | (rx_params[15] << 8) | (rx_params[16] << 16) | (rx_params[17] << 24);
                                new_cfg.kd_q16 = rx_params[18] | (rx_params[19] << 8) | (rx_params[20] << 16) | (rx_params[21] << 24);
                            }
                            if (update_mask & (1 << 5)) {
                                new_cfg.hard_min_angle = rx_params[22] | (rx_params[23] << 8);
                                new_cfg.hard_max_angle = rx_params[24] | (rx_params[25] << 8);
                            }
                            
                            flash_write_config(&new_cfg);
                            config = new_cfg;
                            Kp_q16 = config.kp_q16;
                            Ki_q16 = config.ki_q16;
                            Kd_q16 = config.kd_q16;
                            
                            if (rx_id != 0xFE) {
                                send_status_reply(0x02);
                            }
                        } 
                        // 3. POLL_STATUS Command
                        else if (rx_instruction == 0x03) {
                            if (rx_id != 0xFE) {
                                send_status_reply(0x03);
                            }
                        } 
                        // 4. CLEAR_ERROR Command
                        else if (rx_instruction == 0x04) {
                            overcurrent_fault = 0;
                            stall_fault = 0;
                            overcurrent_ms = 0;
                            pid_integral = 0;
                            prev_error = 0;
                            target_angle = current_angle;
                            ghost_angle_q8 = current_angle << 8;
                            
                            if (rx_id != 0xFE) {
                                send_status_reply(0x04);
                            }
                        }
                        // 5. READ_CONFIG Command
                        else if (rx_instruction == 0x05) {
                            if (rx_id != 0xFE) {
                                send_config_reply();
                            }
                        }
                        // 6. START_TUNING Command
                        else if (rx_instruction == 0x06) {
                            if (!overcurrent_fault && !stall_fault && tune_state == TUNE_STATE_IDLE) {
                                uint8_t duty_percent = rx_params[0];
                                uint8_t hyst_tenths = rx_params[1];
                                uint8_t cycles = rx_params[2];
                                uint16_t cmd_midpoint = rx_params[3] | (rx_params[4] << 8);

                                // Bounds checks & defaults
                                if (duty_percent < 5 || duty_percent > 60) duty_percent = 20; // default 20%
                                if (hyst_tenths < 2 || hyst_tenths > 30) hyst_tenths = 5;      // default 0.5 degrees
                                if (cycles < 3 || cycles > 10) cycles = 5;                     // default 5 cycles

                                tune_target_cycles = cycles;
                                tune_hysteresis_q8 = (int32_t)hyst_tenths * 25; // 0.1 deg = 25.6 in Q8 (approx 25)
                                
                                uint32_t TimerPeriod = TIM1->ARR;
                                tune_relay_amplitude = (TimerPeriod * duty_percent) / 100;

                                if (cmd_midpoint >= config.min_angle && cmd_midpoint <= config.max_angle) {
                                    tune_midpoint_q8 = (int32_t)cmd_midpoint << 8;
                                } else {
                                    tune_midpoint_q8 = current_angle_q8; // default to current position
                                }

                                // Arm tuning state machine
                                tune_state = TUNE_STATE_START;
                                motor_armed = 1;
                            }
                            if (rx_id != 0xFE) {
                                send_status_reply(0x06);
                            }
                        }
                    }
                    rx_state = RX_STATE_HEADER1;
                }
                break;
        }
    }
}

// PID Controller Loop
void pid_update(uint32_t arr_period) {
    if (overcurrent_fault || stall_fault) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    static int32_t filtered_adc_q8 = -1;

    // 1. Read potentiometer raw ADC and apply low pass filter
    uint16_t raw_adc = adc_read(ADC_Channel_7);
    if (filtered_adc_q8 < 0) {
        filtered_adc_q8 = ((int32_t)raw_adc) << 8;
    } else {
        // alpha = 0.10 -> Q8 equivalent is 26/256
        filtered_adc_q8 = (26 * (((int32_t)raw_adc) << 8) + 230 * filtered_adc_q8) >> 8;
    }

    // 2. Convert to Q8 angle using high-precision linear interpolation of hard calibration limits
    // Retains all 8 bits of fractional filtering smoothness from filtered_adc_q8!
    int32_t sweep = config.hard_max_angle - config.hard_min_angle;
    if (config.direction_invert) {
        current_angle_q8 = (config.hard_max_angle << 8) - (sweep * filtered_adc_q8) / 4095;
    } else {
        current_angle_q8 = (sweep * filtered_adc_q8) / 4095 + (config.hard_min_angle << 8);
    }
    
