justimepassnow/custom_servo/mm32_test/src/main.c
    // Update global degree angle (round Q8 to integer)
    current_angle = (current_angle_q8 + 128) >> 8;

    if (!motor_armed) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    // 3. Compute error relative to the Ghost Target
    pid_error = ghost_angle_q8 - current_angle_q8;

    // 4. Check Deadband (only when Ghost Target has fully caught up to final target)
    if (ghost_angle_q8 == (target_angle << 8)) {
        int32_t abs_error = (pid_error >= 0) ? pid_error : -pid_error;
        if (abs_error < DEADBAND_Q8) {
            // Idle state: hold both inputs HIGH (100% duty) for active braking/slow decay
            TIM_SetCompare3(TIM1, arr_period);
            TIM_SetCompare2(TIM1, arr_period);
            pid_integral = 0;
            prev_error = 0;
            if (status_reporting_enabled) {
                status_reporting_enabled = 0;
#if DEBUG_LOG
                print_status();
                uart_print("[STATUS] Target reached! Motor is now idle.\r\n");
#endif
            }
            return;
        } else {
            // Actively tracking outside the deadband, so we are still moving
            status_reporting_enabled = 1;
        }
    }

    // 5. Calculate P, I, D outputs using Q24 scaling
    int64_t p_term = (int64_t)Kp_q16 * (int64_t)pid_error;

    pid_integral += pid_error;
    if (pid_integral > INTEGRAL_LIMIT_Q8) pid_integral = INTEGRAL_LIMIT_Q8;
    else if (pid_integral < -INTEGRAL_LIMIT_Q8) pid_integral = -INTEGRAL_LIMIT_Q8;
    
    int64_t i_term = ((int64_t)Ki_q16 * (int64_t)pid_integral) / 1000;

    pid_derivative = pid_error - prev_error;
    prev_error = pid_error;
    
    int64_t d_term = (int64_t)Kd_q16 * (int64_t)pid_derivative * 1000;

    int64_t pid_out_q24 = p_term + i_term + d_term;
    int32_t pid_out = (int32_t)(pid_out_q24 >> 24);

    // 6. Direct PWM generation
    int32_t pulse = (pid_out >= 0) ? pid_out : -pid_out;
    if (pulse > (int32_t)arr_period) {
        pulse = (int32_t)arr_period;
    }

    int8_t drive_direction = (pid_out >= 0) ? 1 : -1;
    if (config.direction_invert) {
        drive_direction = -drive_direction; // Swap effective direction
    }

    if (drive_direction > 0) {
        // Forward Direction (IN1 [CH3] = 100% High, IN2 [CH2] = Inverted PWM)
        TIM_SetCompare3(TIM1, arr_period);
        TIM_SetCompare2(TIM1, arr_period - pulse);
    } else {
        // Backward Direction (IN1 [CH3] = Inverted PWM, IN2 [CH2] = 100% High)
        TIM_SetCompare3(TIM1, arr_period - pulse);
        TIM_SetCompare2(TIM1, arr_period);
    }
}

void run_relay_tuning(uint32_t arr_period) {
    if (tune_state == TUNE_STATE_START) {
        tune_cycle_count = 0;
        tune_amplitude_sum = 0;
        tune_period_sum = 0;
        tune_peak_high = -999999;
        tune_peak_low = 999999;
        tune_last_crossing_time = millis();
        tune_cycle_start_time = millis();
        tune_timeout_ms = millis();
        
        // Initial forward kick
        tune_relay_output = tune_relay_amplitude;
        tune_state = TUNE_STATE_RUNNING;
        return;
    }

    if (tune_state != TUNE_STATE_RUNNING) return;

    // Safety Timeout (if motor gets stuck or fails to cross boundaries for 3 seconds)
    if (millis() - tune_timeout_ms > 3000) {
        tune_state = TUNE_STATE_FAILED;
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        motor_armed = 0;
        return;
    }

    int32_t error_q8 = current_angle_q8 - tune_midpoint_q8;

    // Track extremes of the oscillation cycle
    if (error_q8 > tune_peak_high) tune_peak_high = error_q8;
    if (error_q8 < tune_peak_low)  tune_peak_low = error_q8;

    // Relay Switching with Hysteresis
    if (tune_relay_output > 0) {
        if (error_q8 > tune_hysteresis_q8) {
            // Upper threshold crossed -> switch to backward drive
            tune_relay_output = -tune_relay_amplitude;
            tune_timeout_ms = millis();
        }
    } else {
        if (error_q8 < -tune_hysteresis_q8) {
            // Lower threshold crossed -> switch to forward drive
            tune_relay_output = tune_relay_amplitude;
            tune_timeout_ms = millis();

            // This completes a full oscillation cycle!
            uint32_t cycle_duration = millis() - tune_cycle_start_time;
            tune_cycle_start_time = millis();

            // Calculate peak-to-peak amplitude
            int32_t p2p_amp = tune_peak_high - tune_peak_low;

            // Discard the very first cycle (transient stabilization)
            if (tune_cycle_count > 0 && p2p_amp > (2 * tune_hysteresis_q8)) {
                tune_amplitude_sum += p2p_amp;
                tune_period_sum += cycle_duration;
            }
            tune_cycle_count++;

            // Reset extremes for next cycle
            tune_peak_high = -999999;
            tune_peak_low = 999999;

            // Check if calibration is complete
            if (tune_cycle_count > tune_target_cycles) {
                tune_state = TUNE_STATE_CALCULATING;
            }
        }
    }

    // Drive Motor using Slow-Decay
    if (tune_state == TUNE_STATE_RUNNING) {
        if (tune_relay_output >= 0) {
            TIM_SetCompare3(TIM1, arr_period);
            TIM_SetCompare2(TIM1, arr_period - tune_relay_output);
        } else {
            TIM_SetCompare3(TIM1, arr_period - (-tune_relay_output));
            TIM_SetCompare2(TIM1, arr_period);
        }
    }
}

void calculate_tuning_gains(void) {
    uint32_t actual_samples = tune_cycle_count - 1; // subtracted the transient cycle
    if (actual_samples == 0) actual_samples = 1;
    
    int32_t a_avg = tune_amplitude_sum / actual_samples;
    int32_t T_avg = tune_period_sum / actual_samples; // in ms
    if (T_avg == 0) T_avg = 1;

    if (a_avg <= (2 * tune_hysteresis_q8)) {
        tune_state = TUNE_STATE_FAILED;
        return;
    }

    // 1. Calculate Ultimate Gain (Ku) in Q16
    // Formula: Ku = (4 * d) / (pi * a)
    // Scaled: Ku_q16 = (262144 * d) / (pi * a)
    int64_t ku_numerator = 262144ULL * tune_relay_amplitude;
    int32_t ku_q16 = (int32_t)((ku_numerator * 100000) / (314159LL * a_avg));

