justimepassnow/custom_servo/mm32_test/src/main.c
    // 2. Apply Ziegler-Nichols formulas for standard PID
    // Kp = 0.6 * Ku
    // Ki = 2.0 * Kp / Pu  (where Pu = T_avg / 1000 sec) -> Ki = 2000 * Kp / T_avg
    // Kd = Kp * Pu / 8    (where Pu = T_avg / 1000 sec) -> Kd = Kp * T_avg / 8000
    config.kp_q16 = (6 * ku_q16) / 10;
    config.ki_q16 = (2000LL * config.kp_q16) / T_avg;
    config.kd_q16 = (config.kp_q16 * T_avg) / 8000;

    // Safety clamp to prevent overflow/unstable gains
    if (config.kp_q16 > 32768000) config.kp_q16 = 32768000; // limit Kp to 500
    if (config.ki_q16 > 655360)   config.ki_q16 = 655360;   // limit Ki to 10
    if (config.kd_q16 > 32768000) config.kd_q16 = 32768000; // limit Kd to 500

    // 3. Persist new gains to Flash
    flash_write_config(&config);

    // 4. Precalculate active variables
    Kp_q16 = config.kp_q16;
    Ki_q16 = config.ki_q16;
    Kd_q16 = config.kd_q16;

    // 5. Exit tuning safely
    target_angle = current_angle;
    ghost_angle_q8 = current_angle_q8;
    tune_state = TUNE_STATE_IDLE;
    
    // Clear tracking flags
    pid_integral = 0;
    prev_error = 0;
}

// 1ms Critical Task Loop (Trajectory Ramping & Protection Checks)
void one_ms_task(uint32_t arr_period) {
    // 1. Trajectory Profiling (Velocity control of Ghost Target) - Disabled for raw direct PID tracking
    ghost_angle_q8 = target_angle << 8;

    // 2. Over-Current Protection
    int32_t current_ma = read_current_ma();
    if (current_ma > (int32_t)config.current_limit) {
        overcurrent_ms++;
        if (overcurrent_ms >= 50) {
            overcurrent_fault = 1;
            TIM_SetCompare3(TIM1, 0);
            TIM_SetCompare2(TIM1, 0);
        }
    } else {
        overcurrent_ms = 0;
    }

    /*
    // 3. Stall Detection (evaluated once every 200ms)
    static uint32_t last_stall_check_time = 0;
    static int32_t last_angle_q8 = -1;
    if (millis() - last_stall_check_time >= 200) {
        last_stall_check_time = millis();
        uint32_t pulse3 = TIM1->CCR3;
        uint32_t pulse2 = TIM1->CCR2;
        
        // Calculate the active PWM duty cycle applied to the motor
        uint32_t active_duty = 0;
        if (pulse3 == arr_period) {
            active_duty = arr_period - pulse2;
        } else if (pulse2 == arr_period) {
            active_duty = arr_period - pulse3;
        }

        // Motor is actively driven only if H-bridge is modulating (not fully braking or coasting)
        if ((pulse3 > 0 && pulse3 < arr_period) || (pulse2 > 0 && pulse2 < arr_period)) {
            if (last_angle_q8 >= 0) {
                int32_t delta = current_angle_q8 - last_angle_q8;
                if (delta < 0) delta = -delta;
                
                int32_t error_deg = target_angle - current_angle;
                if (error_deg < 0) error_deg = -error_deg;
                
                // Trigger stall only if:
                // 1. The position error is significant (> 5 degrees)
                // 2. The motor is being driven with a high duty cycle (> 33% of max period)
                // 3. The angle hasn't changed much (less than 1.5 degrees / 384 counts in Q8)
                if (error_deg > 5 && active_duty > (arr_period / 3) && delta < 384) {
                    stall_fault = 1;
                    TIM_SetCompare3(TIM1, 0);
                    TIM_SetCompare2(TIM1, 0);
                }
            }
            last_angle_q8 = current_angle_q8;
        } else {
            last_angle_q8 = -1;
        }
    }
    */

    // 4. Execute PID loop
    pid_update(arr_period);
}

// Telemetry output logger
void print_status(void) {
    uart_print("[STATUS] Target: ");
    uart_print_int(target_angle);
    uart_print(" deg | Current: ");
    uart_print_int(current_angle);
    uart_print(" deg | Error: ");
    
    int32_t err = target_angle - current_angle;
    if (err < 0) {
        uart_print("-");
        uart_print_int(-err);
    } else {
        uart_print_int(err);
    }
    
    uart_print(" deg | Current Draw: ");
    uart_print_int(read_current_ma());
    uart_print(" mA | Duty: ");
    
    uint32_t pulse3 = TIM1->CCR3;
    uint32_t pulse2 = TIM1->CCR2;
    uint32_t arr = TIM1->ARR;
    if (arr == 0) arr = 1;
    
    if (pulse3 > 0) {
        uart_print_int((pulse3 * 100) / arr);
        uart_print("% (PA6 Forward)\r\n");
    } else if (pulse2 > 0) {
        uart_print_int((pulse2 * 100) / arr);
        uart_print("% (PA8 Backward)\r\n");
    } else {
        uart_print("0% (Idle/Deadband)\r\n");
    }
}

void calibrate_current_sensor(void) {
    int32_t sum = 0;
    // Take 16 quick sequential readings to calculate a clean average offset
    for (int i = 0; i < 16; i++) {
        sum += adc_read(ADC_Channel_5); // PA2 maps to ADC1_VIN[5]
        delay_ms(1);
    }
    zero_current_offset_adc = sum / 16;
    
#if DEBUG_LOG
    uart_print("Current Sensor Baseline Calibrated. Zero-Offset: ");
    uart_print_int(zero_current_offset_adc);
    uart_print(" raw ADC counts.\r\n");
#endif
}

int main(void) {
    GPIO_InitTypeDef        GPIO_InitStruct;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStruct;
    TIM_OCInitTypeDef       TIM_OCInitStruct;

    // 1. Enable 1ms SysTick timekeeping interrupt
    SysTick_Config(48000000U / 1000);

    // 2. Initialize Single-Wire Half-Duplex USART1 at 115200 Baud
    uart_init();
#if DEBUG_LOG
    uart_print("\n--- Smart Servo Overhauled Firmware Init ---\n");
#endif

    // 3. Load or initialize Flash Persistent Parameters
    flash_load_config(&config);
#if DEBUG_LOG
    uart_print("Flash Loaded Configuration ID: ");
    uart_print_int(config.servo_id);
    uart_print("\r\n");
#endif

    // 4. Initialize TIM1 and GPIOA
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_TIM1, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_GPIOA, ENABLE);

    // 5. Configure TIM1 base for 20kHz motor PWM
    uint32_t TimerClock = TIM_GetTIMxClock(TIM1);
    uint32_t TargetFrequency = 20000;
    uint32_t TimerPeriod = (TimerClock / TargetFrequency) - 1;

    TIM_TimeBaseStructInit(&TIM_TimeBaseStruct);
    TIM_TimeBaseStruct.TIM_Prescaler         = 0;
    TIM_TimeBaseStruct.TIM_CounterMode       = TIM_CounterMode_Up;
    TIM_TimeBaseStruct.TIM_Period            = TimerPeriod;
    TIM_TimeBaseStruct.TIM_ClockDivision     = TIM_CKD_Div1;
    TIM_TimeBaseStruct.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStruct);

    // 6. Initialize TIM1 CH3 and CH2 output channels
    TIM_OCStructInit(&TIM_OCInitStruct);
    TIM_OCInitStruct.TIM_OCMode       = TIM_OCMode_PWM1;
    TIM_OCInitStruct.TIM_OutputState  = TIM_OutputState_Enable;
    TIM_OCInitStruct.TIM_Pulse        = 0;
    TIM_OCInitStruct.TIM_OCPolarity   = TIM_OCPolarity_High;
    TIM_OCInitStruct.TIM_OCIdleState  = TIM_OCIdleState_Set;
    TIM_OC3Init(TIM1, &TIM_OCInitStruct); // Channel 3 (PA6)
    TIM_OC2Init(TIM1, &TIM_OCInitStruct); // Channel 2 (PA8)

    // 7. Configure pin AF multiplexing
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_4);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_1);

    // 8. Configure Alternate Function push-pull pins for PWM channels
    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_6 | GPIO_Pin_8;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

