justimepassnow/custom_servo/mm32_test/src/main.c
    // 9. Configure Software Reset button on PA5
    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_5;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 10. Initialize ADC on PA7 and PA2
    adc_init();

    // Calibrate current sensor baseline offset (Auto-Zeroing)
    calibrate_current_sensor();

    // 11. Enable TIM1 Main Outputs
    TIM_Cmd(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);

    // 12. Soft Start: read current position to lock initial target securely
    uint16_t init_raw_adc = adc_read(ADC_Channel_7);
    int32_t sweep = config.hard_max_angle - config.hard_min_angle;
    int32_t init_angle_q8;
    if (config.direction_invert) {
        init_angle_q8 = (config.hard_max_angle << 8) - (sweep * (int32_t)init_raw_adc * 256) / 4095;
    } else {
        init_angle_q8 = (sweep * (int32_t)init_raw_adc * 256) / 4095 + (config.hard_min_angle << 8);
    }
    current_angle_q8 = init_angle_q8;
    current_angle = (init_angle_q8 + 128) >> 8;
    target_angle = current_angle;
    ghost_angle_q8 = init_angle_q8;
    active_velocity = config.max_velocity;

#if DEBUG_LOG
    uart_print("Soft-Start Complete. Locked Initial Angle: ");
    uart_print_int(current_angle);
    uart_print(" deg.\r\n");
#endif

    static uint32_t last_pid_time = 0;

    while (1) {
        // A. Software System Reset Trigger (Debounced reset button on PA5)
        if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5) == Bit_RESET) {
#if DEBUG_LOG
            uart_print("\r\n[RESET] Triggering Software Reset...\r\n");
#endif
            delay_ms(50);
            NVIC_SystemReset();
        }

        // B. Process non-blocking packet bus parser
        process_packet_input();

        // C. Update Trajectory ramps, protections, and PID loop strictly every 1ms
        if (millis() - last_pid_time >= PID_INTERVAL_MS) {
            last_pid_time = millis();
            one_ms_task(TimerPeriod);
        }

        // D. Periodic logging disabled for production to keep single-wire bus clear.
        // The master reads current and position via binary STATUS REPLY packets.

        // E. Prevent cycle spinning overload
        // (Removed delay_ms(1) to run at full speed and avoid UART overrun)
    }
}
